<?php 

$eMail = chkVars($_GET['eMail']);
$pass = chkVars($_GET['pass']);


 function chkVars($inVar, $maxLen = 999) { 
    if(strlen($inVar) > $maxLen) 
        $inVar = substr($inVar,0,$maxLen); 
    return htmlentities($inVar); 
} 
 ?>
 
 <?php echo $eMail ?>
<h1> Шановний замовник! </h1>
<h2>Введений Вами пароль збігся з тим, що зберігається в нашій базі даних. 
Ваше замовлення успішно зареєстрований у системі в date("d.m.Y G:i"). Як тільки 
воно буде оброблено оператором, на адресу Вашої електронної пошти буде надіслано 
повідомлення! </h2>

<br/> 
<h2>Подробиці замовлення:</h2>

  
  У випадку, якщо були відзначені додаткові можливості, потрібно також вивести: <br/> Додатково ви: ";
                               